function hi() {
  console.log("Hello World!");
}
hi();
const config = require("../config");
const {
  cmd,
  commands
} = require("../command");
const {
  runtime
} = require('../lib/functions');
const more = String.fromCharCode(0x200e);
const readMore = more.repeat(0xfa1);
cmd({
  'pattern': "menu2",
  'desc': "gmax menu",
  'category': "menu2",
  'react': '⚡',
  'filename': __filename
}, async (_0x24e275, _0x4260e3, _0x4b76d8, {
  from: _0x37dbbe,
  quoted: _0x5f1e86,
  body: _0x6fa477,
  isCmd: _0x406b9b,
  command: _0x466f64,
  args: _0x429383,
  q: _0x448e8d,
  isGroup: _0x4a9d67,
  sender: _0x3904d4,
  senderNumber: _0x41f619,
  botNumber2: _0x1133b3,
  botNumber: _0x58dd16,
  pushname: _0x53c866,
  isMe: _0x4d8453,
  isOwner: _0x390610,
  groupMetadata: _0x56d642,
  groupName: _0x369866,
  participants: _0xec2882,
  groupAdmins: _0x3a7801,
  isBotAdmins: _0x4668d1,
  isAdmins: _0x126e67,
  reply: _0x4881a0
}) => {
  try {
    let _0x3aea29 = "\n\n       ```" + config.BOT_NAME + "```\n    \n⟣──────────────────⟢\n⚜️ *ᴄʀᴇᴀᴛᴏʀ* : *sɪʀ ɢᴍᴀx (🇹🇿)*\n⚜️ *ᴍᴏᴅᴇ* : *" + config.MODE + "*\n⚜️ *ᴘʀᴇғɪx* : *" + config.PREFIX + "*\n⚜️ *ʀᴀᴍ* : " + (process.memoryUsage().heapUsed / 0x400 / 0x400).toFixed(0x2) + "MB / " + Math.round(require('os').totalmem / 0x400 / 0x400) + "MB\n⚜️ *ᴠᴇʀsɪᴏɴ* : *1.0.5* ⚡\n⚜️ *ᴜᴘᴛɪᴍᴇ* : " + runtime(process.uptime()) + "\n\n⟣──────────────────⟢\n\n> ＧＭＡＸ - ＭＤ- ＢＯＴ\n\n⟣──────────────────⟢\n" + readMore + "\n\n*🏮 `GMAX DOWNLOADER` 🏮* \n\n╭─────────────···◈\n*┋* *⬡ ғʙ*\n*┋* *⬡ ɪɴꜱᴛᴀ*\n*┋* *⬡ sᴘᴏᴛɪғʏ*\n*┋* *⬡ ᴠɪᴅᴇᴏ*\n*┋* *⬡ ɢᴅʀɪᴠᴇ*\n*┋* *⬡ ᴛᴡɪᴛᴛᴇʀ*\n*┋* *⬡ ᴛᴛ*\n*┋* *⬡ ᴍᴇᴅɪᴀғɪʀᴇ*\n*┋* *⬡ ᴍᴇᴅɪᴀғɪʀᴇᴘʀᴏ*\n*┋* *⬡ ꜱᴏɴɢ*\n*┋* *⬡ ᴘʟᴀʏ*\n*┋* *⬡ ᴘʟᴀʏ2*\n*┋* *⬡ ᴘʟᴀʏ3*\n*┋* *⬡ ᴠɪᴅᴇᴏ*\n*┋* *⬡ ᴠɪᴅᴇᴏ2*\n*┋* *⬡ ᴠɪᴅᴇᴏ3*\n*┋* *⬡ ɢɪᴛᴄʟᴏɴᴇ*\n*┋* *⬡ ɪᴍɢ*\n*┋* *⬡ ᴀᴘᴋ*\n*┋* *⬡ ʏᴛᴍᴘ3*\n*┋* *⬡ ʏᴛᴍᴘ4*\n*┋* *⬡ ᴘɪɴᴛᴇʀᴇsᴛ*\n*┋* *⬡ ʙᴀɪsᴄᴏᴘᴇ*\n*┋* *⬡ ɢɪɴɪsɪsɪʟᴀ*\n*╰─────────────╶╶···◈*\n\n*🔎 `SEARCH-CMD` 🔍* \n\n╭─────────────···◈\n*┋* *⬡ ʏᴛꜱ*\n*┋* *⬡ ʏᴛᴀ*\n*┋* *⬡ ɢᴏᴏɢʟᴇ*\n*┋* *⬡ ʟᴏʟɪ*\n*┋* *⬡ ɢɪᴛsᴛᴀʟᴋ*\n*┋* *⬡ ᴡɪᴋɪᴘᴇᴅɪᴀ*\n*┋* *⬡ ᴍᴏᴠɪᴇɪɴғᴏ*\n*┋* *⬡ ɢᴏᴏɢʟᴇ*\n*┋* *⬡ ʙɪʙʟᴇ*\n*┋* *⬡ ᴍᴏᴠɪᴇ*\n*┋* *⬡ ᴡᴇᴀᴛʜᴇʀ*\n*┋* *⬡ ssᴡᴇʙ\n*┋* *⬡ ɴᴘᴍ*\n*╰─────────────╶╶···◈*\n*🧠 `AI-CMD` 🧠* \n\n╭─────────────···◈\n*┋* *⬡ ɢᴘᴛ*\n*┋* *⬡ ᴀɪ*\n*┋* *⬡ ʙᴏᴛ*\n*┋* *⬡ ɢᴍᴀx*\n*┋* *⬡ ɢᴇᴍɪɴɪ*\n*┋* *⬡ ɢᴇᴍɪɴɪᴘʀᴏ*\n*┋* *⬡ ʙɪɴɢ*\n*┋* *⬡ ᴄᴏᴘɪʟᴏᴛ*\n*┋* *⬡ ᴄʟᴀᴜᴅᴇᴀɪ*\n*┋* *⬡ ᴀʀᴛ*\n*┋* *⬡ ᴍɪsᴛʀᴀᴀɪ*\n*┋* *⬡ ᴍᴇᴛᴀᴀɪ*\n*┋* *⬡ ᴄʜᴀᴛɢᴘᴛ*\n*┋* *⬡ ɢᴘᴛ3*\n*┋* *⬡ ɢᴘᴛ4*\n*┋* *⬡ ɢᴘᴛ4ᴏ*\n*┋* *⬡ ʟʟᴀᴍᴀ2*\n*┋* *⬡ ʟʟᴀᴍᴀ3*\n*┋* *⬡ ғʟᴜx*\n*┋* *⬡ ғʟᴜᴘʀᴏ*\n*┋* *⬡ ɪᴍᴀɢɪɴᴇ*\n*┋* *⬡ ᴅᴀʟʟᴇ*\n╰─────────────╶╶···◈\n\n*👨‍💻 `OWNER-CMD` 👩‍💻* \n\n╭─────────────···◈\n*┋* *⬡ ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*\n*┋* *⬡ sᴇᴛᴛɪɴɢs*\n*┋* *⬡ ᴏᴡɴᴇʀ*\n*┋* *⬡ ʀᴇᴘᴏ*\n*┋* *⬡ ʙᴏᴛsᴇᴛᴛɪɴɢs*\n*┋* *⬡ ꜱʏꜱᴛᴇᴍ*\n*┋* *⬡ ᴜᴘᴅᴀᴛᴇ*\n*┋* *⬡ ꜱᴛᴀᴛᴜꜱ*\n*┋* *⬡ ʙʟᴏᴄᴋ*\n*┋* *⬡ ᴜɴʙʟᴏᴄᴋ*\n*┋* *⬡ sʜᴜᴛᴅᴏᴡɴ*\n*┋* *⬡ ᴄʟᴇᴀʀᴄʜᴀᴛs*\n*┋* *⬡ sᴇᴛᴘᴘ*\n*┋* *⬡ ғᴜʟʟᴘᴘ*\n*┋* *⬡ ʙʀᴏᴀᴅᴄᴀsᴛ*\n*┋* *⬡ ᴊɪᴅ*\n*┋* *⬡ ɢᴊɪᴅ*\n*┋* *⬡ ʀᴇꜱᴛᴀʀᴛ*\n╰─────────────╶╶···◈\n\n*👥 `GROUP-CMD` 👥* \n\n╭─────────────···◈\n*┋* *⬡ ʀᴇᴍᴏᴠᴇ*\n*┋* *⬡ ᴅᴇʟᴇᴛᴇ*\n*┋* *⬡ ᴀᴅᴅ*\n*┋* *⬡ ᴋɪᴄᴋ*\n*┋* *⬡ ᴋɪᴄᴋᴀʟʟ*\n*┋* *⬡ sᴇᴛɢᴏᴏᴅʙʏᴇ*\n*┋* *⬡ sᴇᴛᴡᴇʟᴄᴏᴍᴇ*\n*┋* *⬡ ᴘʀᴏᴍᴏᴛᴇ*\n*┋* *⬡ ᴅᴇᴍᴏᴛᴇ*\n*┋* *⬡ ᴛᴀɢᴀʟʟ*\n*┋* *⬡ ɢᴇᴛᴘɪᴄ*\n*┋* *⬡ ɪɴᴠɪᴛᴇ*\n*┋* *⬡ ʀᴇᴠᴏᴋᴇ*\n*┋* *⬡ ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*\n*┋* *⬡ ᴀʟʟʀᴇǫ*\n*┋* *⬡ ᴍᴜᴛᴇ*\n*┋* *⬡ ᴜɴᴍᴜᴛᴇ*\n*┋* *⬡ ʟᴏᴄᴋɢᴄ*\n*┋* *⬡ ᴜɴʟᴏᴄᴋɢᴄ*\n*┋* *⬡ ʟᴇᴀᴠᴇ*\n*┋* *⬡ ᴜᴘᴅᴀᴛᴇɢɴᴀᴍᴇ*\n*┋* *⬡ ᴜᴘᴅᴀᴛᴇɢᴅᴇsᴄ*\n*┋* *⬡ ᴊᴏɪɴ*\n*┋* *⬡ ʜɪᴅᴇᴛᴀɢ*\n*┋* *⬡ ɢɪɴғᴏ*\n*┋* *⬡ ᴅɪsᴀᴘᴘᴇᴀʀ ᴏɴ*\n*┋* *⬡ ᴅɪsᴀᴘᴘᴇᴀʀ ᴏғғ*\n*┋* *⬡ ᴅɪsᴀᴘᴘᴇᴀʀ 7ᴅ 24ʜ 90ᴅ*\n*┋* *⬡ sᴇɴᴅᴅᴍ*\n*┋* *⬡ ᴏᴘᴇɴᴛɪᴍᴇ*\n*┋* *⬡ ᴄʟᴏsᴇᴛɪᴍᴇ*\n╰─────────────╶╶···◈\n\n*💻 `INFO-CMD` 💻* \n\n╭─────────────···◈\n*┋* *⬡ ᴍᴇɴᴜ*\n*┋* *⬡ ᴀʟʟᴍᴇɴᴜ*\n*┋* *⬡ ʙᴇᴛᴀᴍᴇɴᴜ*\n*┋* *⬡ ᴀʙᴏᴜᴛ*\n*┋* *⬡ sᴄʀɪᴘᴛ*\n*┋* *⬡ ʀᴇᴘᴏ*\n*┋* *⬡ ᴍʀɢᴍᴀx*\n*┋* *⬡ ᴀʟɪᴠᴇ*\n*┋* *⬡ ʙᴏᴛɪɴꜰᴏ*\n*┋* *⬡ ꜱᴛᴀᴛᴜꜱ*\n*┋* *⬡ ꜱᴜᴘᴘᴏʀᴛ*\n*┋* *⬡ ᴘɪɴɢ*\n*┋* *⬡ ᴘɪɴɢ2*\n*┋* *⬡ ɢᴍᴀxɪɴᴄ*\n*┋* *⬡ ꜱʏꜱᴛᴇᴍ*\n*┋* *⬡ ᴜᴘᴅᴀᴛᴇ*\n*┋* *⬡ ᴠᴇʀsɪᴏɴ*\n*┋* *⬡ ᴘᴀɪʀ*\n*┋* *⬡ ᴘᴀɪʀ2*\n╰─────────────╶╶···◈\n\n*🍭 `CONVERTER-CMD` 🍭* \n\n╭─────────────···◈\n*┋* *⬡ sᴛɪᴄᴋᴇʀ*\n*┋* *⬡ ᴛʀᴛ*\n*┋* *⬡ ᴛᴛs*\n*┋* *⬡ ᴍᴇᴅɪᴀғɪʀᴇ*\n*┋* *⬡ ᴀᴛᴛᴘ*\n*┋* *⬡ ʟᴏɢᴏ*\n*┋* *⬡ ʟᴏɢᴏ1*\n*┋* *⬡ ʟᴏɢᴏ2*\n*┋* *⬡ ғᴀɴᴄʏ*\n*┋* *⬡ ᴠᴠ*\n*┋* *⬡ ϙʀ*\n*┋* *⬡ ᴛɪɴʏ*\n*┋* *⬡ sʜᴏʀᴛ*\n*┋* *⬡ ᴠᴇʀsɪᴏɴ*\n*┋* *⬡ ᴛᴇᴍᴘᴍᴀɪʟ*\n*┋* *⬡ ᴇɴᴄᴏᴅᴇ*\n*┋* *⬡ ᴅᴇᴄᴏᴅᴇ*\n╰─────────────╶╶···◈\n\n*⚙️ `GMAX-SETTINGS` ⚙️* \n\n╭─────────────···◈\n*┋* *⬡ ɢᴍᴀxᴇɴᴠ*\n*┋* *⬡ ᴜᴘᴅᴀᴛᴇ*\n*┋* *⬡ ᴘɪɴɢ*\n*┋* *⬡ ᴍʀɢᴍᴀx*\n*┋* *⬡ ᴏᴡɴᴇʀ*\n*┋* *⬡ ɢᴍᴀxɪɴᴄ*\n*┋* *⬡ ᴀʙᴏᴜᴛ*\n*┋* *⬡ sᴇᴛᴛɪɴɢs*\n*┋* *⬡ ᴠᴇʀsɪᴏɴ*\n*┋* *⬡ ᴀʟɪᴠᴇ*\n╰─────────────╶╶···◈\n\n*♻️ `RANDOM-CMD` ♻️* \n\n╭─────────────···◈\n*┋* *⬡ ᴄᴘᴘ*\n*┋* *⬡ ᴅᴏɢ*\n*┋* *⬡ ʀᴀɴᴅᴏᴍᴡᴀʟʟᴘᴇʀ*\n*┋* *⬡ ʟᴏʟɪ*\n*┋* *⬡ ᴀᴡᴏᴏ*\n*┋* *⬡ ᴡᴀɪғᴜ*\n*┋* *⬡ ɢᴀʀʟ*\n*┋* *⬡ ᴍᴀɪᴅ*\n*┋* *⬡ ɴᴇᴋᴏ*\n*┋* *⬡ ᴀɴɪᴍᴇ*\n*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ*\n*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ1*\n*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ2*\n*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ3*\n*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ4*\n*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ5*\n╰─────────────╶╶···◈\n\n*🎀 `WALLPAPERS-CMD` 🎀* \n\n╭─────────────···◈\n*┋* *⬡ ɪᴍɢ*\n*┋* *⬡ ᴡᴀʟʟᴘᴀᴘᴇʀ*\n╰─────────────╶╶···◈\n\n*😆 `FUN-CMD` 😆* \n\n╭─────────────···◈\n*┋* *⬡ sʜʏ*\n*┋* *⬡ sʜʏʏ*\n*┋* *⬡ ʜᴀᴘᴘʏ*\n*┋* *⬡ sᴀᴅ*\n*┋* *⬡ ᴀɴɢʀʏ*\n*┋* *⬡ ʜᴀɴᴅ*\n*┋* *⬡ ɴɪᴋᴀʟ*\n*┋* *⬡ ʜᴜɢ*\n*┋* *⬡ ᴍᴏᴏɴ*\n*┋* *⬡ ᴋɪss*\n*┋* *⬡ ᴄᴏɴғᴜsᴇᴅ*\n*┋* *⬡ ʜᴇᴀʀᴛ*\n*┋* *⬡ ᴘɪᴄᴋᴜᴘʟɪɴᴇ*\n*┋* *⬡ ғᴀᴄᴛ*\n*┋* *⬡ ᴛʀᴜᴛʜ*\n*┋* *⬡ ᴅᴀʀᴇ*\n*┋* *⬡ ᴄʜᴀʀᴀᴄᴛᴇʀ*\n╰─────────────╶╶···◈\n\n\n*🛠 `TOOLS-CMD` 🛠* \n\n╭─────────────···◈\n*┋* *⬡ ᴛʀᴛ*\n*┋* *⬡ ᴊᴏᴋᴇ*\n*┋* *⬡ ᴛᴛs*\n*┋* *⬡ ꜰᴀᴄᴛ*\n*┋* *⬡ ɢɪᴛʜᴜʙ*\n*┋* *⬡ ɢᴘᴀꜱꜱ*\n*┋* *⬡ ssᴡᴇʙ*\n*┋* *⬡ sʜᴏʀᴛᴇɴ*\n*┋* *⬡ ᴛɪɴʏᴜʀʟ*\n*┋* *⬡ ʜᴀᴄᴋ*\n*┋* *⬡ ǫᴜᴏᴛᴇ*\n*┋* *⬡ ʀᴇᴘᴏ*\n*┋* *⬡ ᴛɢsᴛɪᴄᴋᴇʀ*\n*┋* *⬡ sʀᴇᴘᴏ*\n*┋* *⬡ ᴅᴇꜰɪɴᴇ*\n*┋* *⬡ ᴀɴᴛɪᴠɪᴇᴡᴏɴᴄᴇ*\n╰─────────────╶╶···◈\n\n*🔞 `NSFW-CMD` 🔞* \n\n╭─────────────···◈\n*┋* *⬡ ᴇᴊᴀᴄᴜʟᴀᴛɪᴏɴ*\n*┋* *⬡ ᴘᴇɴɪs*\n*┋* *⬡ ᴇʀᴇᴄ*\n*┋* *⬡ ɴᴜᴅᴇ*\n*┋* *⬡ sᴇx*\n*┋* *⬡ ᴄᴜᴛᴇ*\n*┋* *⬡ ᴏʀɢᴀsᴍ*\n*┋* *⬡ ᴀɴᴀʟ*\n*┋* *⬡ sᴜsᴘᴇɴsɪᴏɴ*\n*┋* *⬡ ᴋɪss*\n╰─────────────╶╶···◈\n\n\n*━━━━━━━━━━━━━━━━━━━━*⁠⁠⁠⁠\n> ＭＡＤＥ ＢＹ ＳＩＲ ＧＭＡＸ\n*━━━━━━━━━━━━━━━━━━━━━*\n";
    await _0x24e275.sendMessage(_0x37dbbe, {
      'image': {
        'url': "https://i.ibb.co/6BMJmGY/mrfrankofc.jpg"
      },
      'caption': _0x3aea29,
      'contextInfo': {
        'mentionedJid': [_0x4b76d8.sender],
        'forwardingScore': 0x3e7,
        'isForwarded': true,
        'forwardedNewsletterMessageInfo': {
          'newsletterJid': "120363220399229536@newsletter",
          'newsletterName': "❄『 𝐆𝐌𝐀𝐗 𝐌𝐃 』❄️ ",
          'serverMessageId': 0x8f
        }
      }
    }, {
      'quoted': _0x4260e3
    });
    await _0x24e275.sendMessage(_0x37dbbe, {
      'audio': {
        'url': "https://files.catbox.moe/qxhk49.mp3"
      },
      'mimetype': "audio/mp4",
      'ptt': true
    }, {
      'quoted': _0x4260e3
    });
  } catch (_0xd4dff0) {
    console.log(_0xd4dff0);
    _0x4881a0('' + _0xd4dff0);
  }
});
