function hi() {
  console.log("Hello World!");
}
hi();
const config = require("../config");
const {
  cmd,
  commands
} = require("../command");
const {
  runtime
} = require("../lib/functions");
const more = String.fromCharCode(0x200e);
const readMore = more.repeat(0xfa1);
cmd({
  'pattern': "menu",
  'desc': "gmax menu",
  'category': "menu",
  'react': '📑',
  'filename': __filename
}, async (_0x1255a3, _0xb5c298, _0x308cfa, {
  from: _0x5097ff,
  quoted: _0x2a98ce,
  body: _0x5ddede,
  isCmd: _0x2a451d,
  command: _0x32a76d,
  args: _0x511142,
  q: _0x15c897,
  isGroup: _0x5d1d36,
  sender: _0x320e2f,
  senderNumber: _0x34a180,
  botNumber2: _0x2aac49,
  botNumber: _0x2f1d01,
  pushname: _0x319381,
  isMe: _0x1f98c7,
  isOwner: _0x149fe4,
  groupMetadata: _0x5920d4,
  groupName: _0x420323,
  participants: _0x15662a,
  groupAdmins: _0x369ae6,
  isBotAdmins: _0x286e78,
  isAdmins: _0x5e93fa,
  reply: _0x464e37
}) => {
  try {
    let _0xaf75f4 = "\n\n    ```" + config.BOT_NAME + "```\n    \n⟣──────────────────⟢\n★ *ᴄʀᴇᴀᴛᴏʀ* : *sɪʀ ɢᴍᴀx (🇹🇿)*\n★ *ᴍᴏᴅᴇ* : *" + config.MODE + "*\n★  *ᴘʀᴇғɪx* : *" + config.PREFIX + "*\n★  *ʀᴀᴍ* : " + (process.memoryUsage().heapUsed / 0x400 / 0x400).toFixed(0x2) + "MB / " + Math.round(require('os').totalmem / 0x400 / 0x400) + "MB\n★  *ᴠᴇʀsɪᴏɴ* : *1.0.0* ⚡\n★  *ᴜᴘᴛɪᴍᴇ* : " + runtime(process.uptime()) + "\n\n⟣──────────────────⟢\n> ＧＭＡＸ - ＭＤ- ＢＯＴ\n\n⟣──────────────────⟢\n" + readMore + "\n\n*🏮 `GMAX DOWNLOADER` 🏮* \n\n╭─────────────···◈\n*┋* *⬡ ғʙ*\n*┋* *⬡ ɪɴꜱᴛᴀ*\n*┋* *⬡ sᴘᴏᴛɪғʏ*\n*┋* *⬡ ᴠɪᴅᴇᴏ*\n*┋* *⬡ ɢᴅʀɪᴠᴇ*\n*┋* *⬡ ᴛᴡɪᴛᴛᴇʀ*\n*┋* *⬡ ᴛᴛ*\n*┋* *⬡ ᴍᴇᴅɪᴀғɪʀᴇ*\n*┋* *⬡ ꜱᴏɴɢ*\n*┋* *⬡ ᴘʟᴀʏ*\n*┋* *⬡ ᴘʟᴀʏ2*\n*┋* *⬡ ᴘʟᴀʏ3*\n*┋* *⬡ ᴠɪᴅᴇᴏ*\n*┋* *⬡ ᴠɪᴅᴇᴏ2*\n*┋* *⬡ ᴠɪᴅᴇᴏ3*\n*┋* *⬡ ɢɪᴛᴄʟᴏɴᴇ*\n*┋* *⬡ ɪᴍɢ*\n*┋* *⬡ ᴀᴘᴋ*\n*┋* *⬡ ʏᴛᴍᴘ3*\n*┋* *⬡ ʏᴛᴍᴘ4*\n*┋* *⬡ ᴘɪɴᴛᴇʀᴇsᴛ*\n*┋* *⬡ ʙᴀɪsᴄᴏᴘᴇ*\n*┋* *⬡ ɢɪɴɪsɪsɪʟᴀ*\n*╰─────────────╶╶···◈*\n\n*🔎 `SEARCH-CMD` 🔍* \n\n╭─────────────···◈\n*┋* *⬡ ʏᴛꜱ*\n*┋* *⬡ ʏᴛᴀ*\n*┋* *⬡ ɢᴏᴏɢʟᴇ*\n*┋* *⬡ ʟᴏʟɪ*\n*┋* *⬡ ɢɪᴛsᴛᴀʟᴋ*\n*┋* *⬡ ᴡɪᴋɪᴘᴇᴅɪᴀ*\n*┋* *⬡ ᴍᴏᴠɪᴇɪɴғᴏ*\n*┋* *⬡ ɢᴏᴏɢʟᴇ*\n*┋* *⬡ ʙɪʙʟᴇ*\n*┋* *⬡ ᴍᴏᴠɪᴇ*\n*┋* *⬡ ᴡᴇᴀᴛʜᴇʀ*\n*┋* *⬡ ssᴡᴇʙ\n*┋* *⬡ ɴᴘᴍ*\n*╰─────────────╶╶···◈*\n*🧠 `AI-CMD` 🧠* \n\n╭─────────────···◈\n*┋* *⬡ ɢᴘᴛ*\n*┋* *⬡ ᴀɪ*\n*┋* *⬡ sᴜʙᴢᴇʀᴏ*\n*┋* *⬡ ɢᴇᴍɪɴɪ*\n*┋* *⬡ ʙɪɴɢ*\n*┋* *⬡ ᴄᴏᴘɪʟᴏᴛ*\n*┋* *⬡ ᴍɪsᴛʀᴀᴀɪ*\n*┋* *⬡ ᴍᴇᴛᴀᴀɪ*\n*┋* *⬡ ᴄʜᴀᴛɢᴘᴛ*\n*┋* *⬡ ɢᴘᴛ3*\n*┋* *⬡ ɢᴘᴛ4*\n*┋* *⬡ ɢᴘᴛ4ᴏ*\n*┋* *⬡ ʟʟᴀᴍᴀ2*\n*┋* *⬡ ʟʟᴀᴍᴀ3*\n*┋* *⬡ ғʟᴜx*\n*┋* *⬡ ɪᴍᴀɢɪɴᴇ*\n*┋* *⬡ ᴅᴀʟʟᴇ*\n╰─────────────╶╶···◈\n\n*👨‍💻 `OWNER-CMD` 👨‍💻* \n\n╭─────────────···◈\n*┋* *⬡ ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*\n*┋* *⬡ sᴇᴛᴛɪɴɢs*\n*┋* *⬡ ᴏᴡɴᴇʀ*\n*┋* *⬡ ʀᴇᴘᴏ*\n*┋* *⬡ ʙᴏᴛsᴇᴛᴛɪɴɢs*\n*┋* *⬡ ꜱʏꜱᴛᴇᴍ*\n*┋* *⬡ ᴜᴘᴅᴀᴛᴇ*\n*┋* *⬡ ꜱᴛᴀᴛᴜꜱ*\n*┋* *⬡ ʙʟᴏᴄᴋ*\n*┋* *⬡ ᴜɴʙʟᴏᴄᴋ*\n*┋* *⬡ sʜᴜᴛᴅᴏᴡɴ*\n*┋* *⬡ ᴄʟᴇᴀʀᴄʜᴀᴛs*\n*┋* *⬡ sᴇᴛᴘᴘ*\n*┋* *⬡ ғᴜʟʟᴘᴘ*\n*┋* *⬡ ʙʀᴏᴀᴅᴄᴀsᴛ*\n*┋* *⬡ ᴊɪᴅ*\n*┋* *⬡ ɢᴊɪᴅ*\n*┋* *⬡ ʀᴇꜱᴛᴀʀᴛ*\n╰─────────────╶╶···◈\n\n*👥 `GROUP-CMD` 👥* \n\n╭─────────────···◈\n*┋* *⬡ ʀᴇᴍᴏᴠᴇ*\n*┋* *⬡ ᴅᴇʟᴇᴛᴇ*\n*┋* *⬡ ᴀᴅᴅ*\n*┋* *⬡ ᴋɪᴄᴋ*\n*┋* *⬡ ᴋɪᴄᴋᴀʟʟ*\n*┋* *⬡ sᴇᴛɢᴏᴏᴅʙʏᴇ*\n*┋* *⬡ sᴇᴛᴡᴇʟᴄᴏᴍᴇ*\n*┋* *⬡ ᴘʀᴏᴍᴏᴛᴇ*\n*┋* *⬡ ᴅᴇᴍᴏᴛᴇ*\n*┋* *⬡ ᴛᴀɢᴀʟʟ*\n*┋* *⬡ ɢᴇᴛᴘɪᴄ*\n*┋* *⬡ ɪɴᴠɪᴛᴇ*\n*┋* *⬡ ʀᴇᴠᴏᴋᴇ*\n*┋* *⬡ ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*\n*┋* *⬡ ᴀʟʟʀᴇǫ*\n*┋* *⬡ ᴍᴜᴛᴇ*\n*┋* *⬡ ᴜɴᴍᴜᴛᴇ*\n*┋* *⬡ ʟᴏᴄᴋɢᴄ*\n*┋* *⬡ ᴜɴʟᴏᴄᴋɢᴄ*\n*┋* *⬡ ʟᴇᴀᴠᴇ*\n*┋* *⬡ ᴜᴘᴅᴀᴛᴇɢɴᴀᴍᴇ*\n*┋* *⬡ ᴜᴘᴅᴀᴛᴇɢᴅᴇsᴄ*\n*┋* *⬡ ᴊᴏɪɴ*\n*┋* *⬡ ʜɪᴅᴇᴛᴀɢ*\n*┋* *⬡ ɢɪɴғᴏ*\n*┋* *⬡ ᴅɪsᴀᴘᴘᴇᴀʀ ᴏɴ*\n*┋* *⬡ ᴅɪsᴀᴘᴘᴇᴀʀ ᴏғғ*\n*┋* *⬡ ᴅɪsᴀᴘᴘᴇᴀʀ 7ᴅ 24ʜ 90ᴅ*\n*┋* *⬡ sᴇɴᴅᴅᴍ*\n*┋* *⬡ ᴏᴘᴇɴᴛɪᴍᴇ*\n*┋* *⬡ ᴄʟᴏsᴇᴛɪᴍᴇ*\n╰─────────────╶╶···◈\n\n*📃 `INFO-CMD` 📃* \n\n╭─────────────···◈\n*┋* *⬡ ᴍᴇɴᴜ*\n*┋* *⬡ ᴀʟʟᴍᴇɴᴜ*\n*┋* *⬡ ʙᴇᴛᴀᴍᴇɴᴜ*\n*┋* *⬡ ᴀʙᴏᴜᴛ*\n*┋* *⬡ sᴄʀɪᴘᴛ*\n*┋* *⬡ ʀᴇᴘᴏ*\n*┋* *⬡ sɪʀɢᴍᴀx*\n*┋* *⬡ ᴀʟɪᴠᴇ*\n*┋* *⬡ ʙᴏᴛɪɴꜰᴏ*\n*┋* *⬡ ꜱᴛᴀᴛᴜꜱ*\n*┋* *⬡ ꜱᴜᴘᴘᴏʀᴛ*\n*┋* *⬡ ᴘɪɴɢ*\n*┋* *⬡ ᴘɪɴɢ2*\n*┋* *⬡ ɢᴍᴀxɪɴᴄ*\n*┋* *⬡ ꜱʏꜱᴛᴇᴍ*\n*┋* *⬡ ᴘᴀɪʀ*\n*┋* *⬡ ᴘᴀɪʀ2*\n╰─────────────╶╶···◈\n\n*🍭 `CONVERTER-CMD` 🍭* \n\n╭─────────────···◈\n*┋* *⬡ sᴛɪᴄᴋᴇʀ*\n*┋* *⬡ ᴛʀᴛ*\n*┋* *⬡ ᴛʀᴛs*\n*┋* *⬡ ᴛɢsᴛɪᴄᴋᴇʀ*\n*┋* *⬡ ʟᴏɢᴏ*\n*┋* *⬡ ʟᴏɢᴏ1*\n*┋* *⬡ ʟᴏɢᴏ2*\n*┋* *⬡ ғᴀɴᴄʏ*\n*┋* *⬡ ᴠᴠ*\n*┋* *⬡ ᴛᴇᴍᴘᴍᴀɪʟ*\n╰─────────────╶╶···◈\n\n*⚙️ `GMAX-SETTINGS` ⚙️* \n\n╭─────────────···◈\n*┋* *⬡ ɢᴍᴀxᴇɴᴠ*\n*┋* *⬡ ᴜᴘᴅᴀᴛᴇ*\n*┋* *⬡ ᴘɪɴɢ*\n*┋* *⬡ sɪʀɢᴍᴀx*\n*┋* *⬡ ᴏᴡɴᴇʀ*\n*┋* *⬡ ɢᴍᴀxɪɴᴄ*\n*┋* *⬡ ᴀʙᴏᴜᴛ*\n*┋* *⬡ sᴇᴛᴛɪɴɢs*\n*┋* *⬡ ᴀʟɪᴠᴇ*\n╰─────────────╶╶···◈\n\n*♻️ `RANDOM-CMD` ♻️* \n\n╭─────────────···◈\n*┋* *⬡ ᴄᴘᴘ*\n*┋* *⬡ ᴅᴏɢ*\n*┋* *⬡ ʀᴀɴᴅᴏᴍᴡᴀʟʟᴘᴇʀ*\n*┋* *⬡ ʟᴏʟɪ*\n*┋* *⬡ ᴀᴡᴏᴏ*\n*┋* *⬡ ᴡᴀɪғᴜ*\n*┋* *⬡ ɢᴀʀʟ*\n*┋* *⬡ ᴍᴀɪᴅ*\n*┋* *⬡ ɴᴇᴋᴏ*\n*┋* *⬡ ᴀɴɪᴍᴇ*\n*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ*\n*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ1*\n*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ2*\n*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ3*\n*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ4*\n*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ5*\n╰─────────────╶╶···◈\n\n*🎀 `WALLPAPERS-CMD` 🎀* \n\n╭─────────────···◈\n*┋* *⬡ ɪᴍɢ*\n*┋* *⬡ ᴡᴀʟʟᴘᴀᴘᴇʀ*\n╰─────────────╶╶···◈\n\n*😆 `FUN-CMD` 😆* \n\n╭─────────────···◈\n*┋* *⬡ sʜʏ*\n*┋* *⬡ sʜʏʏ*\n*┋* *⬡ ʜᴀᴘᴘʏ*\n*┋* *⬡ sᴀᴅ*\n*┋* *⬡ ᴀɴɢʀʏ*\n*┋* *⬡ ʜᴀɴᴅ*\n*┋* *⬡ ɴɪᴋᴀʟ*\n*┋* *⬡ ʜᴜɢ*\n*┋* *⬡ ᴍᴏᴏɴ*\n*┋* *⬡ ᴋɪss*\n*┋* *⬡ ᴄᴏɴғᴜsᴇᴅ*\n*┋* *⬡ ʜᴇᴀʀᴛ*\n*┋* *⬡ ᴘɪᴄᴋᴜᴘʟɪɴᴇ*\n*┋* *⬡ ғᴀᴄᴛ*\n*┋* *⬡ ᴛʀᴜᴛʜ*\n*┋* *⬡ ᴅᴀʀᴇ*\n*┋* *⬡ ᴄʜᴀʀᴀᴄᴛᴇʀ*\n╰─────────────╶╶···◈\n\n\n*❄️ `OTHER-CMD` ❄️* \n\n╭─────────────···◈\n*┋* *⬡ ᴛʀᴛ*\n*┋* *⬡ ᴊᴏᴋᴇ*\n*┋* *⬡ ᴛᴛs*\n*┋* *⬡ ꜰᴀᴄᴛ*\n*┋* *⬡ ɢɪᴛʜᴜʙ*\n*┋* *⬡ ɢᴘᴀꜱꜱ*\n*┋* *⬡ ʜᴀᴄᴋ*\n*┋* *⬡ ǫᴜᴏᴛᴇ*\n*┋* *⬡ ʀᴇᴘᴏ*\n*┋* *⬡ ᴛɢsᴛɪᴄᴋᴇʀ*\n*┋* *⬡ sʀᴇᴘᴏ*\n*┋* *⬡ ᴅᴇꜰɪɴᴇ*\n*┋* *⬡ ᴀɴᴛɪᴠɪᴇᴡᴏɴᴄᴇ*\n╰─────────────╶╶···◈\n\n*🔞 `NSFW-CMD` 🔞* \n\n╭─────────────···◈\n*┋* *⬡ ᴇᴊᴀᴄᴜʟᴀᴛɪᴏɴ*\n*┋* *⬡ ᴘᴇɴɪs*\n*┋* *⬡ ᴇʀᴇᴄ*\n*┋* *⬡ ɴᴜᴅᴇ*\n*┋* *⬡ sᴇx*\n*┋* *⬡ ᴄᴜᴛᴇ*\n*┋* *⬡ ᴏʀɢᴀsᴍ*\n*┋* *⬡ ᴀɴᴀʟ*\n*┋* *⬡ sᴜsᴘᴇɴsɪᴏɴ*\n*┋* *⬡ ᴋɪss*\n╰─────────────╶╶···◈\n\n\n*━━━━━━━━━━━━━━━━━━━━*⁠⁠⁠⁠\n> ＭＡＤＥ ＢＹ Sir Gmax\n*━━━━━━━━━━━━━━━━━━━━━*\n";
    await _0x1255a3.sendMessage(_0x5097ff, {
      'image': {
        'url': "https://i.ibb.co/6BMJmGY/mrfrankofc.jpg"
      },
      'caption': _0xaf75f4,
      'contextInfo': {
        'mentionedJid': [_0x308cfa.sender],
        'forwardingScore': 0x3e7,
        'isForwarded': true,
        'forwardedNewsletterMessageInfo': {
          'newsletterJid': '120363304325601080@newsletter',
          'newsletterName': "❄️『 𝐆𝐌𝐀𝐗 𝐌𝐃 』❄️ ",
          'serverMessageId': 0x8f
        }
      }
    }, {
      'quoted': _0xb5c298
    });
    await _0x1255a3.sendMessage(_0x5097ff, {
      'audio': {
        'url': "https://files.catbox.moe/qxhk49.mp3"
      },
      'mimetype': 'audio/mp4',
      'ptt': true
    }, {
      'quoted': _0xb5c298
    });
  } catch (_0x493bc7) {
    console.log(_0x493bc7);
    _0x464e37('' + _0x493bc7);
  }
});

// Just Deploy Bro